# Core
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff

# Jupyter / notebooks
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Productivity
eamodio.gitlens
github.copilot
github.copilot-chat
github.vscode-github-actions
mechatroner.rainbow-csv
tamasfe.even-better-toml
ralfstx.vscode-toggle-theme

# Containers
ms-azuretools.vscode-docker
# ms-vscode-remote.remote-containers 